## Pandas Pivot Table

- A PivotTable is a powerful tool to calculate, summarize, and analyze data that lets you see comparisons, patterns, and trends in your data.
- The pivot_table() function in Pandas allows us to create a spreadsheet-style pivot table making it easier to group and analyze our data.

In [2]:
import pandas as pd
import numpy as np

In [3]:
data = pd.DataFrame({'Date': ['2023/01/01','2023/01/01','2023/01/02','2023/01/02'],
                    'City': ['New York','Los Angeles','New York','Los Angeles'],
                    'Temp': [32,75,30,70]})

In [4]:
pivot = data.pivot_table(index = 'Date', columns ='City',values = 'Temp' )

In [5]:
display("Original Data",data)
display('After Pivot Func',pivot)

'Original Data'

         Date         City  Temp
0  2023/01/01     New York    32
1  2023/01/01  Los Angeles    75
2  2023/01/02     New York    30
3  2023/01/02  Los Angeles    70

'After Pivot Func'

City        Los Angeles  New York
Date
2023/01/01         75.0      32.0
2023/01/02         70.0      30.0

In this example, we reshaped the DataFrame with `Date as index`, `City as columns` and `Temperature as values`.

The `pivot` DataFrame is a multidimensional table that shows the temperature based on the city and the date.

Thus the `pivot_table()` operation reshapes the data to make it clearer for further analysis.

## pivot_table() Syntax

**df.pivot_table(values=None, index=None, columns=None, aggfunc='mean', fill_value=None, dropna=True)**
Here,

- index: the column to use as row labels
- columns: the column that will be reshaped as columns
- values: the column(s) to use for the new DataFrame's values
- aggfunc: the function to use for aggregation, defaulting to 'mean'
- fill_value: value to replace missing values with
- dropna: whether to exclude the columns whose entries are all NaN

## pivot_table() with Multiple Values

If we `omit the values argument in pivot_table()`, it selects all the remaining columns `(besides the ones specified index and columns)` as values for the pivot table.

In [10]:
data = pd.DataFrame({'Date': ['2023/01/01','2023/01/01','2023/01/02','2023/01/02'],
                    'City': ['New York','Los Angeles','New York','Los Angeles'],
                    'Temp': [32,75,30,70],
                    'Humidity': [80,10,85,5]})
display(data)

         Date         City  Temp  Humidity
0  2023/01/01     New York    32        80
1  2023/01/01  Los Angeles    75        10
2  2023/01/02     New York    30        85
3  2023/01/02  Los Angeles    70         5

In [11]:
pivot_df = data.pivot_table(index= 'Date', columns ='City',values = ['Humidity','Temp'])
display(pivot_df)

              Humidity                 Temp
City       Los Angeles New York Los Angeles New York
Date
2023/01/01        10.0     80.0        75.0     32.0
2023/01/02         5.0     85.0        70.0     30.0

In [12]:
pivot_df = data.pivot_table(index= 'Date', columns ='City')
display(pivot_df)

              Humidity                 Temp
City       Los Angeles New York Los Angeles New York
Date
2023/01/01        10.0     80.0        75.0     32.0
2023/01/02         5.0     85.0        70.0     30.0

**Created a pivot table for multiple values i.e. Temperature and Humidity.**

## pivot_table() With Aggregate Functions

We can use the pivot_table() method with different `aggregate functions` using the `aggfunc` parameter. We can set the value of aggfunc to functions such as `'sum', 'mean', 'count', 'max' or 'min'`.

In [15]:
data = pd.DataFrame({'Date': ['2023/01/01','2023/01/01','2023/01/02','2023/01/02'],
                    'City': ['New York','Los Angeles','New York','Los Angeles'],
                    'Temp': [32,75,30,70],
                    'Humidity': [80,10,85,5]})
display(data)

         Date         City  Temp  Humidity
0  2023/01/01     New York    32        80
1  2023/01/01  Los Angeles    75        10
2  2023/01/02     New York    30        85
3  2023/01/02  Los Angeles    70         5

In [16]:
pivot_df = data.pivot_table(index= 'City',values = 'Temp', aggfunc= 'mean')
pivot_df

             Temp
City
Los Angeles  72.5
New York     31.0

## Pivot Table With MultiIndex

In [18]:
data = pd.DataFrame({'Date': ['2023-01-01', '2023-01-01', '2023-01-02', '2023-01-02', '2023-01-01', '2023-01-01', '2023-01-02', '2023-01-02'],
        'City': ['New York', 'Los Angeles', 'New York', 'Los Angeles','Delhi', 'Chennai', 'Delhi', 'Chennai'],
        'Country': ['USA', 'USA', 'USA', 'USA', 'India', 'India', 'India', 'India'],
        'Temperature': [32, 75, 30, 77, 75, 80, 78, 79]})
data

         Date         City Country  Temperature
0  2023-01-01     New York     USA           32
1  2023-01-01  Los Angeles     USA           75
2  2023-01-02     New York     USA           30
3  2023-01-02  Los Angeles     USA           77
4  2023-01-01        Delhi   India           75
5  2023-01-01      Chennai   India           80
6  2023-01-02        Delhi   India           78
7  2023-01-02      Chennai   India           79

In [19]:
pivot_df = data.pivot_table(index = ['Country','City'],columns = 'Date')
pivot_df

                    Temperature
Date                 2023-01-01 2023-01-02
Country City
India   Chennai            80.0       79.0
        Delhi              75.0       78.0
USA     Los Angeles        75.0       77.0
        New York           32.0       30.0

In this example, we created a pivot table with a MultiIndex by passing a `list of columns as an index` argument.

A MultiIndex contains ``multiple levels of indexes with columns`` linked to one another through a parent/relationship. Here, `Country` is the `parent column` and` City` is the `child column.`

## Handle Missing Values With pivot_table()

Sometimes while reshaping data using pivot_table(), missing values may occur in the pivot table. Such missing values or NaN values can be handled in a pivot_table() operation using the arguments `fill_value and dropna`.

The `dropna` argument specifies whether to remove the columns whose entries are all NaN. The `default` value of `dropna` is `True`.

In [45]:
data = pd.DataFrame({'Date': ['2023-01-01', '2023-01-01', '2023-01-02', '2023-01-02', '2023-01-03', '2023-01-03', '2023-01-03'],
        'City': ['New York', 'Los Angeles', 'New York', 'Los Angeles', 'New York', 'Los Angeles', 'Chicago'],
        'Temperature': [32, 75, 30, 77, np.nan, 76, np.nan]})
data

         Date         City  Temperature
0  2023-01-01     New York         32.0
1  2023-01-01  Los Angeles         75.0
2  2023-01-02     New York         30.0
3  2023-01-02  Los Angeles         77.0
4  2023-01-03     New York          NaN
5  2023-01-03  Los Angeles         76.0
6  2023-01-03      Chicago          NaN

In [51]:
pivot_df = data.pivot_table(index = 'Date', columns = 'City', values = 'Temperature')
display('Pivot table before using dropna',pivot_df)

'Pivot table before using dropna'

City        Los Angeles  New York
Date
2023-01-01         75.0      32.0
2023-01-02         77.0      30.0
2023-01-03         76.0       NaN

In [55]:
pivot_df_dropna = data.pivot_table(index = 'Date',columns = 'City',dropna=False)
display('pivot table after dropna',pivot_df_dropna)

'pivot table after dropna'

           Temperature
City           Chicago Los Angeles New York
Date
2023-01-01         NaN        75.0     32.0
2023-01-02         NaN        77.0     30.0
2023-01-03         NaN        76.0      NaN

By default, the `dropna parameter is set to True`, resulting in the automatic `removal` of the `Chicago` column.

- `New York` column is `not dropped` despite having one NaN value. This is because `dropna` removes the columns` whose entries are all NaN`.

- The `fill_value` argument on the other hand `replaces all the NaN` values with a `specified value`.

In [69]:
data = pd.DataFrame({'Date': ['2023-01-01', '2023-01-01', '2023-01-02', '2023-01-02', '2023-01-03', '2023-01-03'],
        'City': ['New York', 'Los Angeles', 'New York', 'Los Angeles', 'New York', 'Los Angeles'],
        'Temperature': [32, 75, 30, 77, np.nan, 76]})
data

         Date         City  Temperature
0  2023-01-01     New York         32.0
1  2023-01-01  Los Angeles         75.0
2  2023-01-02     New York         30.0
3  2023-01-02  Los Angeles         77.0
4  2023-01-03     New York          NaN
5  2023-01-03  Los Angeles         76.0

In [71]:
pivot_df = data.pivot_table(index = 'Date', columns = 'City', values = 'Temperature',fill_value=0)
pivot_df

City        Los Angeles  New York
Date
2023-01-01         75.0      32.0
2023-01-02         77.0      30.0
2023-01-03         76.0       0.0

In this example, we replaced the NaN values with 0 using the fill_value=0 argument.